prst/TM4C1294/blinky.c
//*****************************************************************************
//
// blinky.c - Simple example to blink the on-board LED.
//
// This is start code of the EK-TM4C1294XL.
//
//*****************************************************************************

#include <stdlib.h>
#include <stdint.h>
#include "inc/tm4c1294ncpdt.h"

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/pwm.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

//#include "inc/hw_types.h"
//#include "drivers/pinout.h"
//#include "driverlib/rom.h"
//#include "driverlib/rom_map.h"

//typedef  enum { FALSE, TRUE } bool;


//*****************************************************************************
//! \addtogroup example_list
//! <h1>Blinky (blinky)</h1>
//! A very simple example that blinks the on-board LED using direct register
//! access.
//*****************************************************************************



//******************************************************************************
//#define _LEDS_POS_I_SET   ( GPIO_PORTA_AHB_DATA_R |=  (1<<2) ) // Anod (Common) 4
//#define _LEDS_POS_I_CLR   ( GPIO_PORTA_AHB_DATA_R &= ~(1<<2) ) // Anod (Common) 4
#define _LEDS_POS_I_SET   ( GPIO_PORTQ_DATA_R |=  (1<<3) ) // Anod (Common) 4
#define _LEDS_POS_I_CLR   ( GPIO_PORTQ_DATA_R &= ~(1<<3) ) // Anod (Common) 4
#define _LEDS_POS_II_SET  ( GPIO_PORTP_DATA_R |=  (1<<3) )     // Anod (Common) 1
#define _LEDS_POS_II_CLR  ( GPIO_PORTP_DATA_R &= ~(1<<3) )     // Anod (Common) 1
#define _LEDS_POS_III_SET ( GPIO_PORTQ_DATA_R |=  (1<<1) )     // Anod (Common) 2
#define _LEDS_POS_III_CLR ( GPIO_PORTQ_DATA_R &= ~(1<<1) )     // Anod (Common) 2
//#define _LEDS_POS_IV_SET  ( GPIO_PORTA_AHB_DATA_R |=  (1<<3) ) // Anod (Common) 3
//#define _LEDS_POS_IV_CLR  ( GPIO_PORTA_AHB_DATA_R &= ~(1<<3) ) // Anod (Common) 3
#define _LEDS_POS_IV_SET  ( GPIO_PORTQ_DATA_R |=  (1<<2) ) // Anod (Common) 3
#define _LEDS_POS_IV_CLR  ( GPIO_PORTQ_DATA_R &= ~(1<<2) ) // Anod (Common) 3
#define _LEDS_POS_V_SET   ( GPIO_PORTM_DATA_R |=  (1<<6) )     // Anod (Common) 0
#define _LEDS_POS_V_CLR   ( GPIO_PORTM_DATA_R &= ~(1<<6) )     // Anod (Common) 0
//******************************************************************************
#define  BTN_PCS_0  (1)
#define  BTN_PCS_1  (2)
//******************************************************************************


// LEDS[0,1,2,3]=[PN1,PN0,PF4,PF0]
// USER_SWITCH[0,1]=[PJ0,PJ1]

//******************************************************************************
// TYPES
//******************************************************************************
typedef enum {
	_TIMER_READY     = 0,
	_TIMER_NOT_READY = 1
} t_timer_stat;

typedef struct {
	uint8_t    ready_to_use   :1;
	uint8_t    timer_is_set   :1;
	uint32_t   set_timer_limit;
	uint32_t   cur_timer_val;
	uint32_t  *common_rule;
} t_Scheduler;
//******************************************************************************



//******************************************************************************
// Global and system variables
//******************************************************************************
t_Scheduler timer_leds5x8;
t_Scheduler timer_leds1on, timer_leds1off;
t_Scheduler timer_leds2on, timer_leds2off;
t_Scheduler timer_leds3on, timer_leds3off;
t_Scheduler timer_leds4on, timer_leds4off;
t_Scheduler timer_count;

uint32_t  dly1 = 0;
uint32_t  dly2 = 0;
uint32_t  dly3 = 0;
uint32_t  dly4 = 0;

uint32_t    leds_position = 1;
//******************************************************************************




//******************************************************************************
void drv_sys_init_gpio ( void );
void drv_usr_init_led_7segments ( void );
void drv_led_7segments_position (unsigned char pos);
void drv_led_7segments_symbol ( uint8_t position, uint8_t symbol, uint8_t comma );
int drv_led_blink (void);
void drv_usr_init_scheduler_and_all_timers (void);
t_timer_stat delay_timer_count (uint8_t cfg);
t_timer_stat delay_timer_leds5x8 (uint8_t cfg);
char* IntToStr(int i, char b[]);
char* FloatToLeds5x8(float ff, char b[]);
char *ultostr(unsigned long value, char *ptr, int base);
char *ftostr(float value, char *ptr, int base, uint8_t *comma);
//******************************************************************************



//******************************************************************************
// void drv_init_gpio ( void )
// Initialisation for GPIO, basic configuration and default startup settings.
//******************************************************************************
void drv_sys_init_gpio ( void ) {
    volatile uint32_t ui32Loop;

/*
Datasheet @ page 757 @
Texas Instruments-Production Data @ Tiva TM4C1294NCPDT Microcontroller
Table 10-7. GPIO Register Map

Offset 	Name Type 	Reset 					Description page
0x000 	GPIODATA 	RW 		0x0000.0000 	GPIO Data 759
0x400 	GPIODIR 	RW 		0x0000.0000 	GPIO Direction 760
0x404 	GPIOIS 		RW 		0x0000.0000 	GPIO Interrupt Sense 761
0x408 	GPIOIBE 	RW 		0x0000.0000 	GPIO Interrupt Both Edges 762
0x40C 	GPIOIEV 	RW 		0x0000.0000 	GPIO Interrupt Event 763
0x410 	GPIOIM 		RW 		0x0000.0000 	GPIO Interrupt Mask 764
0x414 	GPIORIS 	RO 		0x0000.0000 	GPIO Raw Interrupt Status 765
0x418 	GPIOMIS 	RO 		0x0000.0000 	GPIO Masked Interrupt Status 767
0x41C 	GPIOICR 	W1C 	0x0000.0000 	GPIO Interrupt Clear 769
0x420 	GPIOAFSEL 	RW 		- 				GPIO Alternate Function Select 770
0x500 	GPIODR2R 	RW 		0x0000.00FF 	GPIO 2-mA Drive Select 772
0x504 	GPIODR4R 	RW 		0x0000.0000 	GPIO 4-mA Drive Select 773
0x508 	GPIODR8R 	RW 		0x0000.0000 	GPIO 8-mA Drive Select 774
0x50C 	GPIOODR 	RW 		0x0000.0000 	GPIO Open Drain Select 775
0x510 	GPIOPUR 	RW 		- 				GPIO Pull-Up Select 776
0x514 	GPIOPDR 	RW 		0x0000.0000 	GPIO Pull-Down Select 778
0x518 	GPIOSLR 	RW 		0x0000.0000 	GPIO Slew Rate Control Select 780
0x51C 	GPIODEN 	RW 		- 				GPIO Digital Enable 781
0x520 	GPIOLOCK 	RW 		0x0000.0001 	GPIO Lock 783
0x524 	GPIOCR 		- 		- 				GPIO Commit 784
0x528 	GPIOAMSEL 	RW 		0x0000.0000 	GPIO Analog Mode Select 786
0x52C 	GPIOPCTL 	RW 		- 				GPIO Port Control 787
0x530 	GPIOADCCTL 	RW 		0x0000.0000 	GPIO ADC Control 789
0x534 	GPIODMACTL 	RW 		0x0000.0000 	GPIO DMA Control 790
0x538 	GPIOSI 		RW 		0x0000.0000 	GPIO Select Interrupt 791
0x53C 	GPIODR12R 	RW 		0x0000.0000 	GPIO 12-mA Drive Select 792
0x540 	GPIOWAKEPEN RW 		0x0000.0000 	GPIO Wake Pin Enable 793
0x544 	GPIOWAKELVL RW 		0x0000.0000 	GPIO Wake Level 795
0x548 	GPIOWAKESTAT RO 	0x0000.0000 	GPIO Wake Status 797
0xFC0 	GPIOPP 		RO 		0x0000.0001 	GPIO Peripheral Property 799
0xFC4 	GPIOPC 		RW 		0x0000.0000 	GPIO Peripheral Configuration 800
0xFD0 	GPIOPeriphID4 RO 	0x0000.0000 	GPIO Peripheral Identification 4 803
0xFD4 	GPIOPeriphID5 RO 	0x0000.0000 	GPIO Peripheral Identification 5 804
0xFD8 	GPIOPeriphID6 RO 	0x0000.0000 	GPIO Peripheral Identification 6 805
0xFDC 	GPIOPeriphID7 RO 	0x0000.0000 	GPIO Peripheral Identification 7 806
0xFE0 	GPIOPeriphID0 RO 	0x0000.0061 	GPIO Peripheral Identification 0 807
0xFE4 	GPIOPeriphID1 RO 	0x0000.0000 	GPIO Peripheral Identification 1 808
0xFE8 	GPIOPeriphID2 RO 	0x0000.0018 	GPIO Peripheral Identification 2 809
0xFEC 	GPIOPeriphID3 RO 	0x0000.0001 	GPIO Peripheral Identification 3 810
0xFF0 	GPIOPCellID0 RO 	0x0000.000D 	GPIO PrimeCell Identification 0 811
0xFF4 	GPIOPCellID1 RO 	0x0000.00F0 	GPIO PrimeCell Identification 1 812
0xFF8 	GPIOPCellID2 RO 	0x0000.0005 	GPIO PrimeCell Identification 2 813
0xFFC 	GPIOPCellID3 RO 	0x0000.00B1 	GPIO PrimeCell Identification 3 814 */

    // Enable the GPIO port that is used for the on-board LED.
    SYSCTL_RCGCGPIO_R =
		SYSCTL_RCGCGPIO_R14 | //SYSCTL_RCGCGPIO_R14=GPIO Port Q Run Mode Clock
		SYSCTL_RCGCGPIO_R13 | //SYSCTL_RCGCGPIO_R13=GPIO Port P Run Mode Clock
    	SYSCTL_RCGCGPIO_R12 | //SYSCTL_RCGCGPIO_R12=GPIO Port N Run Mode Clock
		SYSCTL_RCGCGPIO_R11 | //SYSCTL_RCGCGPIO_R11=GPIO Port M Run Mode Clock
    	SYSCTL_RCGCGPIO_R9  | //SYSCTL_RCGCGPIO_R9= GPIO Port K Run Mode Clock
    	SYSCTL_RCGCGPIO_R8  | //SYSCTL_RCGCGPIO_R8= GPIO Port J Run Mode Clock
    	SYSCTL_RCGCGPIO_R5  | //SYSCTL_RCGCGPIO_R5= GPIO Port F Run Mode Clock
    	SYSCTL_RCGCGPIO_R1  | //SYSCTL_RCGCGPIO_R1= GPIO Port B Run Mode Clock
    	SYSCTL_RCGCGPIO_R0  ; //SYSCTL_RCGCGPIO_R0= GPIO Port A Run Mode Clock

    // Do a dummy read to insert a few cycles after enabling the peripheral.
    ui32Loop = SYSCTL_RCGCGPIO_R;

    // ..................................
    GPIO_PORTN_DIR_R     = 0;
    GPIO_PORTN_DEN_R     = 0;
    GPIO_PORTF_AHB_DIR_R = 0;
    GPIO_PORTF_AHB_DEN_R = 0;

    // Enable the GPIO pin for the LED (PN1).  Set the direction as output, and
    // enable the GPIO pin for digital function.
    GPIO_PORTN_DIR_R |= 0x02;
    GPIO_PORTN_DEN_R |= 0x02;

    // Enable the GPIO pin for the LED (PN0).  Set the direction as output, and
    // enable the GPIO pin for digital function.
    GPIO_PORTN_DIR_R |= 0x01;
    GPIO_PORTN_DEN_R |= 0x01;

    // Enable the GPIO pin for the LED (PF4).  Set the direction as output, and
    // enable the GPIO pin for digital function.
    GPIO_PORTF_AHB_DIR_R |= 0x10;
    GPIO_PORTF_AHB_DEN_R |= 0x10;

