prst/TM4C1294/blinky.c
  if (tmp == 0) {
    count++;
  }

  while(tmp > 0) {
    tmp = tmp/base;
    count++;
  }

  ptr += count;
  *ptr = '\0';

  do {
    res = value - base * (t = value / base);
    if (res < 10) {
      * -- ptr = '0' + res;
    } else
    if ((res >= 10) && (res < 16)) {
        * --ptr = 'A' - 10 + res;
    }
  } while ((value = t) != 0);

  return(ptr);
}//******************************************************************************



//******************************************************************************
char *ftostr(float value, char *ptr, int base, uint8_t *comma)
{
  unsigned long t=0, res=0;
  unsigned long tmp=value;
  unsigned long val=0;
  int           count=0;
  float         ostatok_float=0;
  uint32_t      celoe=0, ostatok_int=0;
  uint8_t       less_then_1=0;
  uint8_t       dlina_ostatka=0;

  if (NULL == ptr) {
    return NULL;
  }

  if (NULL == comma) {
    return NULL;
  }

  /*if (tmp == 0) {
    count++;
  }

  while(tmp > 0) {
    tmp = tmp/base;
    count++;
  }*/

  celoe = (int)value;
  ostatok_float = value - celoe;

  if (celoe<1) {
	  *comma=0;
  	  less_then_1 = 1;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*comma);
		ptr += 0;
  }
  else
  if (celoe<10) {
	  *comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*comma+1);
		ptr += 1;
  }
  else
  if (celoe<100) {
	  *comma=1;
		ostatok_int = (uint32_t)((ostatok_float * 1000));
		dlina_ostatka = 5 - (*comma+1);
		ptr += 2;
  }
  else
  if (celoe<1000) {
	  *comma=2;
		ostatok_int = (uint32_t)((ostatok_float * 100));
		dlina_ostatka = 5 - (*comma+1);
		ptr += 3;
  }
  else
  if (celoe<10000) {
	  *comma=3;
		ostatok_int = (uint32_t)((ostatok_float * 10));
		dlina_ostatka = 5 - (*comma+1);
		ptr += 4;
  }
  else
  if (celoe<100000) {
	  *comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 1));
		dlina_ostatka = 5 - (*comma+1);
		ptr += 5;
  }
  else
  if (celoe<1000000) {
	  *comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 0));
		dlina_ostatka = 5 - (*comma+1);
		ptr += 6;
  }

//  ptr += count;
//  *ptr = '\0';  // set first 0

  val = value;

  do {  // display - Celoe
	t = val / base;
    res = val - base * t; // res = drobnaya ot value
    if (res < 10) {
      *--ptr = '0' + res;
    }
  } while ((val = t) != 0);

  if (celoe<1) { ptr += 5;  }
  else
  if (celoe<10) { ptr += 4; }
  else
  if (celoe<100) { ptr += 4; }
  else
  if (celoe<1000) { ptr += 4; }
  else
  if (celoe<10000) { ptr += 4; }
  else
  if (celoe<100000) { ptr += 4; }
  else
  if (celoe<1000000) { ptr += 4; }

  if (*comma<5) { // Display - Ostatok
      //*--ptr = '0' + res;
	  do {
	    if (dlina_ostatka>0) {
			t = ostatok_int / base;
			res = ostatok_int - base * t; // res = drobnaya ot value
			if (res < 10) {
			  *ptr-- = '0' + res;
			}
	      dlina_ostatka--;
	    }
	  } while ( (ostatok_int=t)!=0 || dlina_ostatka!=0 );
  }

  return(ptr);
}//******************************************************************************



char data[5] ={ 1,  3,  5,  7,  9 };
char datas[5]={'1','3','5','7','9'};


//******************************************************************************
// Blinks on the leds and indicator.
//******************************************************************************
int main (void) {
    volatile uint32_t pos;
    volatile uint32_t cnt=0;
    char    *tmp;
    float   in=0;
    uint8_t comma;
	char    *p_str;

	//double num=34267;
	//char   output[10];
	//snprintf(output,10,"%f",num);

	//char buffer [50];
	//unsigned long a = 5;
	//int n;
	//n=sprintf (buffer, "%lu", a);

    //SysCtlClockSet(SYSCTL_SYSDIV_1|SYSCTL_USE_OSC|SYSCTL_OSC_MAIN|SYSCTL_XTAL_16MHZ);
    //SysCtlPWMClockSet(SYSCTL_PWMDIV_1); //Set the PWM clock to the system clock.

    drv_sys_init_gpio ();
    drv_usr_init_led_7segments ();
    drv_usr_init_scheduler_and_all_timers ();

    //ROM_GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_0);
    //ROM_GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_1);

    in = 0.0001;

	while(1) {  // Loop forever.
		if (  _TIMER_READY == delay_timer_leds5x8('?') ) {
			if ( _TIMER_READY == delay_timer_count('?') ) {
				//in+=0.0001;
				delay_timer_count(0);
			}
			if ( pos < 5 ) {
				//tmp = ltoa(in, (char *)data); // ltoa - max string 34 bytes.
				//tmp = IntToStr(in, (char *)data); // ltoa - max string 34 bytes.
				//tmp = FloatToLeds5x8(in, data); // ltoa - max string 34 bytes.
				//ultostr(56789,data,10); //  value, *ptr, base
				p_str = ftostr ( in, data, 10, &comma ); // value, *ptr, base, *comma_possition
				drv_led_7segments_symbol (pos, data[pos], comma); // display info
				drv_led_7segments_position (pos); // dinamic switching
				pos++;
				cnt++;
    		} else {
				pos = 0;
    		}
			delay_timer_leds5x8(0);
    	}
		drv_led_blink ();

		if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_0 ) {
			if ( in<1 ) in += 0.00001;
			else
			if ( in<10 ) in += 0.0001;
			else
			if ( in<100 ) in += 0.001;
			else
			if ( in<1000 ) in += 0.01;
			else
			if ( in<10000 ) in += 0.1;
		}
		if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_1 ) {
			if ( in>0 )
			if ( in<1 ) in -= 0.00001;
			else
			if ( in<10 ) in -= 0.0001;
			else
			if ( in<100 ) in -= 0.001;
			else
			if ( in<1000 ) in -= 0.01;
			else
			if ( in<10000 ) in -= 0.1;
		}
    }
}
//******************************************************************************
